<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Comment</key>
		<string>Downloads the latest Rancher client, build an installer package and import it into the Jamf Pro server.</string>
		<key>Identifier</key>
		<string>com.github.vamadi32.jamf.Keka-latest</string>
		<key>Input</key>
		<dict>
			<key>CATEGORY</key>
			<string>Productivity</string>
			<key>GROUP_NAME</key>
			<string>Keka-update-smart</string>
			<key>GROUP_TEMPLATE</key>
			<string>JamfSmartGroupTemplate.xml</string>
			<key>NAME</key>
			<string>Keka</string>
			<key>POLICY_CATEGORY</key>
			<string>Testing</string>
			<key>POLICY_NAME</key>
			<string>Install Latest %NAME%</string>
			<key>POLICY_TEMPLATE</key>
			<string>JamfPolicyTemplate.xml</string>
			<key>SELF_SERVICE_DESCRIPTION</key>
			<string>%NAME% is a File Archiver.</string>
			<key>SELF_SERVICE_DISPLAY_NAME</key>
			<string>Install Latest %NAME%</string>
			<key>SELF_SERVICE_ICON</key>
			<string>%NAME%.png</string>
			<key>TESTING_GROUP_NAME</key>
			<string>Testing</string>
			<key>UPDATE_PREDICATE</key>
			<string>pkg_uploaded == False</string>
		</dict>
		<key>MinimumVersion</key>
		<string>2.3</string>
		<key>ParentRecipe</key>
		<string>com.github.smithjw.pkg.Keka</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>pkg_category</key>
					<string>%CATEGORY%</string>
				</dict>
				<key>Processor</key>
				<string>com.github.grahampugh.jamf-upload.processors/JamfPackageUploader</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>predicate</key>
					<string>%UPDATE_PREDICATE%</string>
				</dict>
				<key>Processor</key>
				<string>StopProcessingIf</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>computergroup_name</key>
					<string>%GROUP_NAME%</string>
					<key>computergroup_template</key>
					<string>%GROUP_TEMPLATE%</string>
					<key>replace_group</key>
					<string>True</string>
				</dict>
				<key>Processor</key>
				<string>com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>icon</key>
					<string>%SELF_SERVICE_ICON%</string>
					<key>policy_name</key>
					<string>%POLICY_NAME%</string>
					<key>policy_template</key>
					<string>%POLICY_TEMPLATE%</string>
					<key>replace_policy</key>
					<string>True</string>
				</dict>
				<key>Processor</key>
				<string>com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader</string>
			</dict>
		</array>
	</dict>
</plist>
