Comment: Created with Recipe Robot v2.2.0 (https://github.com/homebysix/recipe-robot)
Description: Downloads the latest version of RapidAPI.
Identifier: com.github.vamadi32.download.RapidAPI
MinimumVersion: '2.3'

Input:
  NAME: RapidAPI

Process:

- Processor: URLDownloader
  Arguments:
    filename: '%NAME%.zip'
    url: 'https://paw.cloud/download'

- Processor: EndOfCheckPhase

- Processor: Unarchiver
  Arguments:
    archive_path: '%pathname%'
    destination_path: '%RECIPE_CACHE_DIR%/%NAME%'
    purge_destination: true

- Processor: CodeSignatureVerifier
  Arguments:
    input_path: '%RECIPE_CACHE_DIR%/%NAME%/RapidAPI.app'
    requirement: anchor apple generic and identifier "com.luckymarmot.Paw" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "84599RL58A")

- Processor: Versioner
  Arguments:
    input_plist_path: '%RECIPE_CACHE_DIR%/%NAME%/RapidAPI.app/Contents/Info.plist'
    plist_version_key: CFBundleShortVersionString
