Comment: GROUP_CRITERIA should be either 'arm64' or 'x86_64'
Description: Downloads the latest Rancher client and makes a pkg. Then, uploads the package to the Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.github.vamadi32.jamf.RancherDesktopSilicon-latest
ParentRecipe: com.github.vamadi32.pkg.RancherDesktopSilicon
MinimumVersion: '1.0.0'

Input:
  NAME: Rancher Desktop
  CATEGORY: Virtualization
  GROUP_CRITERIA: 'arm64'
  GROUP_NAME: '%NAME% - %DOWNLOAD_ARCHITECTURE% - update-smart'
  GROUP_TEMPLATE: 'SmartGroupTest-architecture-smart.xml'
  TESTING_GROUP_NAME: Testing
  POLICY_CATEGORY: '%CATEGORY%'
  POLICY_TEMPLATE: JamfPolicyTemplate.xml
  POLICY_NAME: 'Install Latest %NAME% (%DOWNLOAD_ARCHITECTURE%)'
  SELF_SERVICE_DISPLAY_NAME: '%POLICY_NAME%'
  SELF_SERVICE_DESCRIPTION: 'Rancher Desktop is an electron based application that wraps other tools while itself providing the user experience to create a simple experience.'
  SELF_SERVICE_ICON: '%NAME%.png'
  SOFTWARE_TITLE: '%NAME%'
  INSTALL_BUTTON_TEXT: 'Install'
  REINSTALL_BUTTON_TEXT: 'Install'
  UPDATE_PREDICATE: 'pkg_uploaded == False'
  STOP_PREDICATE: "NOT virus_total_analyzer_summary_result.data.ratio BEGINSWITH '0'"

Process:
  - Processor: io.github.hjuutilainen.VirusTotalAnalyzer/VirusTotalAnalyzer

  - Processor: StopProcessingIf
    Arguments:
      predicate: "%STOP_PREDICATE%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: '%CATEGORY%'

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
    Arguments:
      pkg_category: '%CATEGORY%'

  - Processor: StopProcessingIf
    Arguments:
      predicate: '%UPDATE_PREDICATE%'

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_template: '%GROUP_TEMPLATE%'
      computergroup_name: '%GROUP_NAME%'

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Arguments:
      policy_template: '%POLICY_TEMPLATE%'
      policy_name: '%POLICY_NAME%'
      icon: '%SELF_SERVICE_ICON%'
