<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v2.2.0 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of Mumble and creates a package.</string>
	<key>Identifier</key>
	<string>com.github.vamadi32.pkg.Mumble</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Mumble</string>
		<key>VERSIONTYPE</key>
        <string>CFBundleVersion</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.vamadi32.download.Mumble</string>
	<key>Process</key>
	<array>
	    <dict>
            <key>Arguments</key>
            <dict>
                <key>input_plist_path</key>

 <string>%RECIPE_CACHE_DIR%/downloads/Mumble.app/Contents/Info.plist</string>
                <key>plist_version_key</key>
                <string>%VERSIONTYPE%</string>
            </dict>
            <key>Processor</key>
            <string>Versioner</string>
        </dict>
		<dict>
			<key>Processor</key>
			<string>AppPkgCreator</string>
			<key>Arguments</key>
            <dict>
                <key>pkgname</key>
                <string>%NAME%-%version%</string>
            </dict>
		</dict>
	</array>
</dict>
</plist>
