Comment: Downloads the latest ATLAS.ti app, build an installer package and import it into the Jamf Pro server.
Identifier: com.github.vamadi32.jamf.ATLAS.ti-latest
ParentRecipe: io.github.hjuutilainen.pkg.ATLAS.ti
MinimumVersion: '2.3'

Input:
  NAME: ATLAS.ti
  CATEGORY: Data and Visualization
  GROUP_NAME: '%NAME%-update-smart'
  GROUP_TEMPLATE: JamfSmartGroupTemplate.xml
  POLICY_CATEGORY: '%CATEGORY%'
  POLICY_NAME: Install Latest %NAME%
  POLICY_TEMPLATE: JamfPolicyTemplate.xml
  SELF_SERVICE_DESCRIPTION: '%NAME% is a Data Analysis Tool.'
  SELF_SERVICE_DISPLAY_NAME: Install Latest %NAME%
  SELF_SERVICE_ICON: '%NAME%.png'
  TESTING_GROUP_NAME: Testing
  UPDATE_PREDICATE: pkg_uploaded == False
  STOP_PREDICATE: "NOT virus_total_analyzer_summary_result.data.ratio BEGINSWITH '0'"

Process:
- Processor: io.github.hjuutilainen.VirusTotalAnalyzer/VirusTotalAnalyzer

- Processor: StopProcessingIf
  Arguments:
    predicate: "%STOP_PREDICATE%"

- Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
  Arguments:
    category_name: '%CATEGORY%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'

- Processor: StopProcessingIf
  Arguments:
    predicate: '%UPDATE_PREDICATE%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
  Arguments:
    computergroup_name: '%GROUP_NAME%'
    computergroup_template: '%GROUP_TEMPLATE%'
    replace_group: 'True'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
  Arguments:
    icon: '%SELF_SERVICE_ICON%'
    policy_name: '%POLICY_NAME%'
    policy_template: '%POLICY_TEMPLATE%'
    replace_policy: 'True'
