Comment: Recipe automatically generated by JamfRecipeMaker
Identifier: com.github.vamadi32.jamf.Viscosity-latest
ParentRecipe: com.github.vamadi32.pkg.Viscosity
MinimumVersion: '2.3'

Input:
  NAME: Viscosity
  CATEGORY: VPN
  GROUP_NAME: Viscosity-update-smart
  GROUP_TEMPLATE: JamfSmartGroupTemplate.xml
  POLICY_CATEGORY: '%CATEGORY%'
  POLICY_NAME: Install Latest %NAME%
  POLICY_TEMPLATE: JamfPolicyTemplateRunCommand.xml
  POLICY_RUN_COMMAND: 'chown -R "$(stat -f%Su /dev/console):staff" "/Applications/%NAME%.app" && echo "Corrected permissions for %NAME%."'
  SELF_SERVICE_DESCRIPTION: Viscosity is a VPN Client.
  SELF_SERVICE_DISPLAY_NAME: Install Latest %NAME%
  SELF_SERVICE_ICON: '%NAME%.png'
  TESTING_GROUP_NAME: Testing
  UPDATE_PREDICATE: pkg_uploaded == False
  STOP_PREDICATE: "NOT virus_total_analyzer_summary_result.data.ratio BEGINSWITH '0'"

Process:
  - Processor: io.github.hjuutilainen.VirusTotalAnalyzer/VirusTotalAnalyzer

  - Processor: StopProcessingIf
    Arguments:
      predicate: "%STOP_PREDICATE%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
    Arguments:
      pkg_category: '%CATEGORY%'

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_name: '%GROUP_NAME%'
      computergroup_template: '%GROUP_TEMPLATE%'
      replace_group: 'True'

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Arguments:
      icon: '%SELF_SERVICE_ICON%'
      policy_name: '%POLICY_NAME%'
      policy_template: '%POLICY_TEMPLATE%'
      replace_policy: 'True'
