Description: Downloads latest Google Chrome enterprise package and renames it based on the Chrome version.
Identifier: com.github.vamadi32.pkg.GoogleChrome-latest
ParentRecipe: com.github.vamadi32.download.GoogleChrome-latest
MinimumVersion: '2.3'

Input:
  NAME: GoogleChrome
  BUILD: Universal

Process:
- Processor: AppDmgVersioner
  Arguments:
    dmg_path: '%pathname%'

- Processor: PkgRootCreator
  Arguments:
    pkgdirs:
      Applications: '0775'
    pkgroot: '%RECIPE_CACHE_DIR%/%NAME%'

- Processor: Copier
  Arguments:
    destination_path: '%pkgroot%/Applications/%app_name%'
    source_path: '%pathname%/%app_name%'

- Processor: PkgCreator
  Arguments:
    pkg_request:
      chown:
      - group: admin
        path: Applications
        user: root
      id: '%bundleid%'
      options: purge_ds_store
      pkgname: '%NAME%-%BUILD%-%version%'
      version: '%version%'