Identifier: com.github.vamadi32.jamf.GoogleChrome-triggeronly
ParentRecipe: com.github.vamadi32.pkg.GoogleChrome-latest
MinimumVersion: '2.3'

Input:
  NAME: Google Chrome
  SOFTWARE_TITLE: Google Chrome
  CATEGORY: Browsers
  POLICY_CATEGORY: Mac-Enrollment
  TRIGGER_NAME: "install_chrome"
  TRIGGER_POLICY_NAME: "[01_macEnrollment] macEnroll %NAME%"
  TRIGGER_POLICY_CATEGORY: "Browsers"
  TRIGGER_POLICY_RUN_COMMAND: 'macEnrollInstallChrome'
  POLICY_TEMPLATE: JamfPolicyTemplateTriggerOnly.xml
  POLICY_NAME: '%TRIGGER_POLICY_NAME%'
  UPDATE_PREDICATE: 'pkg_uploaded == False'
  STOP_PREDICATE: "NOT virus_total_analyzer_summary_result.data.ratio BEGINSWITH '0'"

Process:
  - Processor: io.github.hjuutilainen.VirusTotalAnalyzer/VirusTotalAnalyzer

  - Processor: StopProcessingIf
    Arguments:
      predicate: "%STOP_PREDICATE%"

  - Processor: com.github.grahampugh.recipes.commonprocessors/VersionRegexGenerator

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: '%CATEGORY%'
      replace_category: true

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
    Arguments:
      pkg_category: '%CATEGORY%'
      replace_category: true

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Arguments:
      policy_template: '%POLICY_TEMPLATE%'
      policy_name: '%POLICY_NAME%'
      policy_category: '%CATEGORY%'
      replace_policy: true
