Comment: Downloads the current release version of RStudio, builds a package, and uploads to jamf pro
Identifier: com.github.vamadi32.jamf.RStudio-latest
ParentRecipe: com.github.rtrouton.pkg.RStudio
MinimumVersion: '2.3'

Input:
  NAME: RStudio 
  CATEGORY: IDE
  GROUP_NAME: '%NAME%-update-smart'
  GROUP_TEMPLATE: JamfSmartGroupTemplate.xml
  POLICY_CATEGORY: '%CATEGORY%'
  POLICY_NAME: 'Install Latest %NAME%'
  POLICY_TEMPLATE: JamfPolicyTemplateScriptRunCommand.xml
  POLICY_RUN_COMMAND: 'chown -R "$(stat -f%Su /dev/console):staff" "/Applications/%NAME%.app" && echo "Corrected permissions for %NAME%."'
  SELF_SERVICE_DESCRIPTION: Powerful Integrated development environment for R.
  SCRIPT_NAME: preinstall.sh
  SCRIPT_PRIORITY: Before
  SCRIPT_NOTES: "${GITHUB_SERVER_URL}/${GITHUB_REPOSITORY}/commit/${GITHUB_SHA} \n- GitHub Actions Run Number: #${GITHUB_RUN_NUMBER}"
  PARAMETER4_LABEL: "%NAME%"
  PARAMETER5_LABEL: ""
  PARAMETER6_LABEL: ""
  PARAMETER4_VALUE: "%NAME%"
  PARAMETER5_VALUE: ""
  PARAMETER6_VALUE: ""
  SELF_SERVICE_DISPLAY_NAME: 'Install Latest %NAME%'
  SELF_SERVICE_ICON: '%NAME%.png'
  TESTING_GROUP_NAME: Testing
  UPDATE_PREDICATE: pkg_uploaded == False
  STOP_PREDICATE: "NOT virus_total_analyzer_summary_result.data.ratio BEGINSWITH '0'"

Process:
  - Processor: io.github.hjuutilainen.VirusTotalAnalyzer/VirusTotalAnalyzer

  - Processor: StopProcessingIf
    Arguments:
      predicate: '%UPDATE_PREDICATE%'

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
    Arguments:
      pkg_category: '%CATEGORY%'
  
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfScriptUploader
    Arguments:
      script_category: "%CATEGORY%"
      script_path: "%SCRIPT_NAME%"
      script_priority: "%SCRIPT_PRIORITY%"
      script_notes: "%SCRIPT_NOTES%"
      script_parameter4: "%PARAMETER4_LABEL%"
      script_parameter5: "%PARAMETER5_LABEL%"
      script_parameter6: "%PARAMETER6_LABEL%"


  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_name: '%GROUP_NAME%'
      computergroup_template: '%GROUP_TEMPLATE%'
      replace_group: 'True'

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Arguments:
      icon: '%SELF_SERVICE_ICON%'
      policy_name: '%POLICY_NAME%'
      policy_template: '%POLICY_TEMPLATE%'
      replace_policy: 'True'
