Comment: GROUP_CRITERIA should be either 'arm64' or 'x86_64'
Description: Downloads the latest AmazonCorreto21 Open JDK Java Flavour and makes a pkg. Then, uploads the package to the Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.github.vamadi32.jamf.AmazonCorretoX86_64
ParentRecipe: com.github.rtrouton.pkg.intelamazoncorettojdk21
MinimumVersion: '2.3'

Input:
  NAME: AmazonCorreto21
  CATEGORY: Interpreter
  GROUP_CRITERIA: 'x86_64'
  GROUP_NAME: '%NAME% - %GROUP_CRITERIA% - update-smart'
  GROUP_TEMPLATE: 'JamfSmartGroup-architecture-with-exclusion-smart.xml'
  TESTING_GROUP_NAME: Testing
  EXCLUSION_GROUP_NAME: ""
  POLICY_CATEGORY: '%CATEGORY%'
  POLICY_TEMPLATE: JamfPolicyTemplate.xml
  POLICY_NAME: 'Install Latest %NAME% (%GROUP_CRITERIA%)'
  SELF_SERVICE_DISPLAY_NAME: '%POLICY_NAME%'
  SELF_SERVICE_DESCRIPTION: 'Corretto is a no-cost, multiplatform, production-ready distribution of the Open Java Development Kit (OpenJDK).'
  SELF_SERVICE_ICON: 'Corretto.png'
  SOFTWARE_TITLE: '%NAME%'
  INSTALL_BUTTON_TEXT: 'Install'
  REINSTALL_BUTTON_TEXT: 'Install'
  UPDATE_PREDICATE: 'pkg_uploaded == False'
  STOP_PREDICATE: "NOT virus_total_analyzer_summary_result.data.ratio BEGINSWITH '0'"

Process:
  - Processor: io.github.hjuutilainen.VirusTotalAnalyzer/VirusTotalAnalyzer

  - Processor: StopProcessingIf
    Arguments:
      predicate: "%STOP_PREDICATE%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: '%CATEGORY%'
      replace_category: true

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
    Arguments:
      pkg_category: '%CATEGORY%'
      replace_category: true

  - Processor: StopProcessingIf
    Arguments:
      predicate: '%UPDATE_PREDICATE%'

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_template: '%GROUP_TEMPLATE%'
      computergroup_name: '%GROUP_NAME%'
      replace_group: true

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Arguments:
      policy_template: '%POLICY_TEMPLATE%'
      policy_name: '%POLICY_NAME%'
      icon: '%SELF_SERVICE_ICON%'
      replace_policy: true
