Description: Downloads the latest version of FireFox and makes a pkg. Then, uploads the package to the Jamf Pro Server and creates a Self Service Policy and Smart Group. 
Identifier: com.github.vamadi32.recipes.jamf.FireFox-latest-patch
ParentRecipe: com.github.autopkg.grahampugh-recipes.jamf.Firefox
MinimumVersion: '2.3'

Input:
  NAME: 'Firefox'
  CATEGORY: Browsers
  PATCH_ENABLED: 'true'
  PATCH_NAME: 'Mozilla %NAME%'
  PATCH_SOFTWARE_TITLE: 'Mozilla %NAME%'
  PATCH_TEMPLATE: PatchTemplate-selfserviceNoNotification.xml
  POLICY_NAME: Install Latest %NAME%

Process:
- Processor: com.github.grahampugh.jamf-upload.processors/JamfPatchUploader
  Arguments:
    patch_icon_policy_name: '%POLICY_NAME%'
    patch_name: '%PATCH_NAME%'
    patch_softwaretitle: '%PATCH_SOFTWARE_TITLE%'
    patch_template: '%PATCH_TEMPLATE%'