Comment: "Downloads the latest AutoFirma, builds an installer package, and imports it into the Jamf Pro server."
Identifier: "com.github.vamadi32.jamf.AutoFirma-latest"
ParentRecipe: "com.github.vamadi32.download.AutoFirma-latest"
MinimumVersion: "2.3"

Input:
  DOWNLOAD_ARCHITECTURE: aarch64
  NAME: "AutoFirma"
  CATEGORY: "Signing"
  GROUP_NAME: "%NAME%-arm64-update-smart"
  EXCLUSION_GROUP_NAME: ""
  SELF_SERVICE_CATEGORY: "%CATEGORY%"
  SELF_SERVICE_FEATURE_BOOLEAN: ""
  GROUP_CRITERIA: "arm64"
  GROUP_TEMPLATE: "SmartGroup-update-smart-FMAExclusion-arch-regex.xml"
  POLICY_CATEGORY: "%CATEGORY%"
  POLICY_NAME: "Install Latest %NAME%"
  POLICY_TEMPLATE: "JamfPolicySSCategroyFMAExclusionTemplate.xml"
  SELF_SERVICE_DESCRIPTION: "%NAME% is a digital signing tool for Spanish eGovernment services."
  SELF_SERVICE_DISPLAY_NAME: "Install Latest %NAME%"
  SELF_SERVICE_ICON: "%NAME%.png"
  TESTING_GROUP_NAME: "Testing"
  # This predicate will stop the recipe if pkg_uploaded == False is NOT true,
  # meaning the .pkg was just uploaded. (i.e., if the .pkg hasn't been changed, skip the rest.)
  UPDATE_PREDICATE: "pkg_uploaded == False"
  # This stops the recipe if VirusTotal check fails (anything other than 0/0).
  STOP_PREDICATE: "NOT virus_total_analyzer_summary_result.data.ratio BEGINSWITH '0'"

Process:
  - Processor: "io.github.hjuutilainen.VirusTotalAnalyzer/VirusTotalAnalyzer"

  - Processor: "StopProcessingIf"
    Arguments:
      predicate: "%STOP_PREDICATE%"

  - Processor: "com.github.grahampugh.recipes.commonprocessors/VersionRegexGenerator"
    # This processor can parse a version from the downloaded .pkg name
    # or from the environment if needed. Adjust if your version comes directly
    # from your parent recipe's Versioner output.

  - Processor: "com.github.grahampugh.jamf-upload.processors/JamfPackageUploader"
    Arguments:
      pkg_category: "%CATEGORY%"

  - Processor: "StopProcessingIf"
    Arguments:
      predicate: "%UPDATE_PREDICATE%"

  - Processor: "com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader"
    Arguments:
      computergroup_name: "%GROUP_NAME%"
      computergroup_template: "%GROUP_TEMPLATE%"
      replace_group: "True"

  - Processor: "com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader"
    Arguments:
      icon: "%SELF_SERVICE_ICON%"
      policy_name: "%POLICY_NAME%"
      policy_template: "%POLICY_TEMPLATE%"
      replace_policy: "True"