Comment: GROUP_CRITERIA should be either 'arm64' or 'x86_64'
Description: Downloads the latest version and makes a pkg. Then, uploads the package to the Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.github.vamadi32.jamf.Spotify-ARM-latest
ParentRecipe: com.github.homebysix.pkg.Spotify
MinimumVersion: '0.2.0'

Input:
  NAME: Spotify
  SOFTWARE_TITLE: '%NAME%'
  GROUP_CRITERIA: arm64
  CATEGORY: Digital Media
  GROUP_NAME: '%NAME%-%GROUP_CRITERIA%-update-smart'
  GROUP_TEMPLATE: SmartGroupTest-architecture-smart.xml
  POLICY_CATEGORY: '%CATEGORY%'
  POLICY_TEMPLATE: JamfPolicyTemplate.xml
  POLICY_NAME: 'Install Latest %NAME%-%GROUP_CRITERIA%'
  POLICY_RUN_COMMAND: ' '
  SELF_SERVICE_DISPLAY_NAME: 'Install Latest %NAME%'
  SELF_SERVICE_DESCRIPTION: Stream music, create playlists and more.
  SELF_SERVICE_ICON: '%SOFTWARE_TITLE%.png'
  TESTING_GROUP_NAME: Testing
  INSTALL_BUTTON_TEXT: Install
  REINSTALL_BUTTON_TEXT: Install
  UPDATE_PREDICATE: pkg_uploaded == False
  STOP_PREDICATE: "NOT virus_total_analyzer_summary_result.data.ratio BEGINSWITH '0'"

Process:
  - Processor: io.github.hjuutilainen.VirusTotalAnalyzer/VirusTotalAnalyzer

  - Processor: StopProcessingIf
    Arguments:
      predicate: "%STOP_PREDICATE%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: '%CATEGORY%'

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
    Arguments:
      pkg_category: '%CATEGORY%'

  - Processor: StopProcessingIf
    Arguments:
      predicate: '%UPDATE_PREDICATE%'

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_template: '%GROUP_TEMPLATE%'
      computergroup_name: '%GROUP_NAME%'

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Arguments:
      policy_template: '%POLICY_TEMPLATE%'
      policy_name: '%POLICY_NAME%'
      icon: '%SELF_SERVICE_ICON%'
