Description: Downloads the latest Spotify dmg and creates a pkg from it.
Identifier: com.github.vamadi32.pkg.Spotify-INTEL-latest
ParentRecipe: com.github.vamadi32.download.Spotify-INTEL-latest
MinimumVersion: 0.2.0

Input:
  NAME: Spotify
  VERSION_SPLIT_ON: .g

Process:
- Processor: AppDmgVersioner
  Arguments:
    dmg_path: '%pathname%'

- Processor: com.github.homebysix.VersionSplitter/VersionSplitter
  Arguments:
    split_on: '%VERSION_SPLIT_ON%'

- Processor: PkgRootCreator
  Arguments:
    pkgdirs:
      Applications: '0775'
    pkgroot: '%RECIPE_CACHE_DIR%/%NAME%'

- Processor: Copier
  Arguments:
    destination_path: '%pkgroot%/Applications/Spotify.app'
    source_path: '%pathname%/Spotify.app'

- Processor: PkgCreator
  Arguments:
    pkg_request:
      chown:
      - group: admin
        path: Applications
        user: root
      id: '%bundleid%'
      options: purge_ds_store
      pkgdir: '%RECIPE_CACHE_DIR%'
      pkgname: '%NAME%-%SUPPORTED_ARCH_INTEL%-%version%'
      scripts: Scripts
