Comment: Downloads the latest version of Maxon App and imports it into the Jamf Pro server.
Identifier: com.github.vamadi32.jamf.MaxonApp-latest
ParentRecipe: com.github.foigus.pkg.MaxonApp
MinimumVersion: '2.3'

Input:
  NAME: Maxon
  CATEGORY: Digital Media
  GROUP_NAME: maxon-update-smart
  GROUP_TEMPLATE: SmartGroup-update-smart-regex.xml
  POLICY_CATEGORY: '%CATEGORY%'
  POLICY_NAME: Install Latest %NAME%
  POLICY_TEMPLATE: JamfPolicyTemplate.xml
  SELF_SERVICE_DESCRIPTION: '%NAME% is an app used to install apps from Maxon.' 
  SELF_SERVICE_DISPLAY_NAME: Install Latest %NAME%
  SELF_SERVICE_ICON: '%NAME%.png'
  TESTING_GROUP_NAME: Testing
  UPDATE_PREDICATE: pkg_uploaded == False
  STOP_PREDICATE: "NOT virus_total_analyzer_summary_result.data.ratio BEGINSWITH '0'"

Process:
- Processor: io.github.hjuutilainen.VirusTotalAnalyzer/VirusTotalAnalyzer

- Processor: StopProcessingIf
  Arguments:
    predicate: "%STOP_PREDICATE%"

- Processor: com.github.grahampugh.recipes.commonprocessors/VersionRegexGenerator

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'

- Processor: StopProcessingIf
  Arguments:
    predicate: '%UPDATE_PREDICATE%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
  Arguments:
    computergroup_name: '%GROUP_NAME%'
    computergroup_template: '%GROUP_TEMPLATE%'
    replace_group: 'True'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
  Arguments:
    icon: '%SELF_SERVICE_ICON%'
    policy_name: '%POLICY_NAME%'
    policy_template: '%POLICY_TEMPLATE%'
    replace_policy: 'True'
